#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

module.alb_ingress.data.aws_iam_policy_document.this: Refreshing state...
module.kubernetes.module.eks.data.aws_partition.current: Refreshing state...
module.kubernetes.module.eks.data.aws_iam_policy_document.cluster_assume_role_policy: Refreshing state...
module.external_dns.module.iam_assumable_role_admin.data.aws_caller_identity.current: Refreshing state...
module.alb_ingress.data.aws_caller_identity.this: Refreshing state...
module.cert_manager.data.aws_region.current: Refreshing state...
module.cluster_autoscaler.data.aws_region.current: Refreshing state...
module.alb_ingress.module.iam_assumable_role_admin.data.aws_caller_identity.current: Refreshing state...
module.network.data.aws_availability_zones.available: Refreshing state...
module.cert_manager.module.iam_assumable_role_admin.data.aws_caller_identity.current: Refreshing state...
module.kubernetes.module.eks.data.aws_ami.eks_worker_windows: Refreshing state...
module.argocd.module.iam_assumable_role_admin.data.aws_caller_identity.current: Refreshing state...
module.alb_ingress.module.iam_assumable_role_admin.data.aws_partition.current: Refreshing state...
module.cluster_autoscaler.module.iam_assumable_role_admin.data.aws_caller_identity.current: Refreshing state...
module.kubernetes.module.eks.data.aws_ami.eks_worker: Refreshing state...
module.external_dns.data.aws_region.current: Refreshing state...
module.kubernetes.module.eks.data.aws_caller_identity.current: Refreshing state...
module.alb_ingress.data.aws_region.current: Refreshing state...
module.argocd.data.aws_region.current: Refreshing state...
module.cluster_autoscaler.data.aws_caller_identity.this: Refreshing state...
module.kubernetes.data.aws_ami.eks_gpu_worker: Refreshing state...
module.kubernetes.module.eks.data.aws_iam_policy_document.workers_assume_role_policy: Refreshing state...
module.network.data.template_file.private[1]: Refreshing state...
module.network.data.template_file.private[0]: Refreshing state...
module.network.data.template_file.private[2]: Refreshing state...
module.network.data.template_file.public[1]: Refreshing state...
module.network.data.template_file.public[2]: Refreshing state...
module.network.data.template_file.public[0]: Refreshing state...

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_eks_cluster.cluster will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_cluster" "cluster"  {
      + arn                       = (known after apply)
      + certificate_authority     = (known after apply)
      + created_at                = (known after apply)
      + enabled_cluster_log_types = (known after apply)
      + endpoint                  = (known after apply)
      + id                        = (known after apply)
      + identity                  = (known after apply)
      + name                      = (known after apply)
      + platform_version          = (known after apply)
      + role_arn                  = (known after apply)
      + status                    = (known after apply)
      + tags                      = (known after apply)
      + version                   = (known after apply)
      + vpc_config                = (known after apply)
    }

  # data.aws_eks_cluster_auth.cluster will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_cluster_auth" "cluster"  {
      + id    = (known after apply)
      + name  = (known after apply)
      + token = (sensitive value)
    }

  # aws_cognito_user_pool_client.argocd will be created
  + resource "aws_cognito_user_pool_client" "argocd" {
      + allowed_oauth_flows                  = [
          + "code",
        ]
      + allowed_oauth_flows_user_pool_client = true
      + allowed_oauth_scopes                 = [
          + "email",
          + "openid",
          + "profile",
        ]
      + callback_urls                        = [
          + "https://argocd.sak.devops100.com/auth/callback",
        ]
      + client_secret                        = (known after apply)
      + generate_secret                      = true
      + id                                   = (known after apply)
      + name                                 = "argocd"
      + prevent_user_existence_errors        = (known after apply)
      + refresh_token_validity               = 30
      + supported_identity_providers         = [
          + "COGNITO",
        ]
      + user_pool_id                         = (known after apply)
    }

  # aws_cognito_user_pool_client.kubeflow will be created
  + resource "aws_cognito_user_pool_client" "kubeflow" {
      + allowed_oauth_flows                  = [
          + "code",
        ]
      + allowed_oauth_flows_user_pool_client = true
      + allowed_oauth_scopes                 = [
          + "aws.cognito.signin.user.admin",
          + "email",
          + "openid",
          + "profile",
        ]
      + callback_urls                        = [
          + "https://kubeflow.sak.devops100.com/oauth2/idpresponse",
        ]
      + client_secret                        = (known after apply)
      + generate_secret                      = true
      + id                                   = (known after apply)
      + name                                 = "kubeflow"
      + prevent_user_existence_errors        = (known after apply)
      + refresh_token_validity               = 30
      + supported_identity_providers         = [
          + "COGNITO",
        ]
      + user_pool_id                         = (known after apply)
    }

  # module.acm.aws_acm_certificate.this[0] will be created
  + resource "aws_acm_certificate" "this" {
      + arn                       = (known after apply)
      + domain_name               = "sak.devops100.com"
      + domain_validation_options = (known after apply)
      + id                        = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "*.sak.devops100.com",
        ]
      + tags                      = {
          + "environment" = "test1"
          + "project"     = "Kubeflow"
        }
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"

      + options {
          + certificate_transparency_logging_preference = "ENABLED"
        }
    }

  # module.acm.aws_acm_certificate_validation.this[0] will be created
  + resource "aws_acm_certificate_validation" "this" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # module.acm.aws_route53_record.validation[0] will be created
  + resource "aws_route53_record" "validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = (known after apply)
    }

  # module.alb_ingress.data.aws_eks_cluster.this will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_cluster" "this"  {
      + arn                       = (known after apply)
      + certificate_authority     = (known after apply)
      + created_at                = (known after apply)
      + enabled_cluster_log_types = (known after apply)
      + endpoint                  = (known after apply)
      + id                        = (known after apply)
      + identity                  = (known after apply)
      + name                      = (known after apply)
      + platform_version          = (known after apply)
      + role_arn                  = (known after apply)
      + status                    = (known after apply)
      + tags                      = (known after apply)
      + version                   = (known after apply)
      + vpc_config                = (known after apply)
    }

  # module.alb_ingress.aws_iam_policy.this will be created
  + resource "aws_iam_policy" "this" {
      + arn         = (known after apply)
      + description = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "aws-alb-ingress-controller"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "wafv2:GetWebACLForResource",
                          + "wafv2:GetWebACL",
                          + "wafv2:DisassociateWebACL",
                          + "wafv2:AssociateWebACL",
                          + "waf:GetWebACL",
                          + "waf-regional:GetWebACLForResource",
                          + "waf-regional:GetWebACL",
                          + "waf-regional:DisassociateWebACL",
                          + "waf-regional:AssociateWebACL",
                          + "tag:TagResources",
                          + "tag:GetResources",
                          + "shield:ListProtections",
                          + "shield:GetSubscriptionState",
                          + "shield:DescribeSubscription",
                          + "shield:DescribeProtection",
                          + "shield:DeleteProtection",
                          + "shield:CreateProtection",
                          + "iam:ListServerCertificates",
                          + "iam:GetServerCertificate",
                          + "iam:CreateServiceLinkedRole",
                          + "elasticloadbalancing:SetWebACL",
                          + "elasticloadbalancing:SetSubnets",
                          + "elasticloadbalancing:SetSecurityGroups",
                          + "elasticloadbalancing:SetIpAddressType",
                          + "elasticloadbalancing:RemoveTags",
                          + "elasticloadbalancing:RemoveListenerCertificates",
                          + "elasticloadbalancing:RegisterTargets",
                          + "elasticloadbalancing:ModifyTargetGroupAttributes",
                          + "elasticloadbalancing:ModifyTargetGroup",
                          + "elasticloadbalancing:ModifyRule",
                          + "elasticloadbalancing:ModifyLoadBalancerAttributes",
                          + "elasticloadbalancing:ModifyListener",
                          + "elasticloadbalancing:DescribeTargetHealth",
                          + "elasticloadbalancing:DescribeTargetGroups",
                          + "elasticloadbalancing:DescribeTargetGroupAttributes",
                          + "elasticloadbalancing:DescribeTags",
                          + "elasticloadbalancing:DescribeSSLPolicies",
                          + "elasticloadbalancing:DescribeRules",
                          + "elasticloadbalancing:DescribeLoadBalancers",
                          + "elasticloadbalancing:DescribeLoadBalancerAttributes",
                          + "elasticloadbalancing:DescribeListeners",
                          + "elasticloadbalancing:DescribeListenerCertificates",
                          + "elasticloadbalancing:DeregisterTargets",
                          + "elasticloadbalancing:DeleteTargetGroup",
                          + "elasticloadbalancing:DeleteRule",
                          + "elasticloadbalancing:DeleteLoadBalancer",
                          + "elasticloadbalancing:DeleteListener",
                          + "elasticloadbalancing:CreateTargetGroup",
                          + "elasticloadbalancing:CreateRule",
                          + "elasticloadbalancing:CreateLoadBalancer",
                          + "elasticloadbalancing:CreateListener",
                          + "elasticloadbalancing:AddTags",
                          + "elasticloadbalancing:AddListenerCertificates",
                          + "ec2:RevokeSecurityGroupIngress",
                          + "ec2:ModifyNetworkInterfaceAttribute",
                          + "ec2:ModifyInstanceAttribute",
                          + "ec2:DescribeVpcs",
                          + "ec2:DescribeTags",
                          + "ec2:DescribeSubnets",
                          + "ec2:DescribeSecurityGroups",
                          + "ec2:DescribeNetworkInterfaces",
                          + "ec2:DescribeInternetGateways",
                          + "ec2:DescribeInstances",
                          + "ec2:DescribeInstanceStatus",
                          + "ec2:DescribeAddresses",
                          + "ec2:DescribeAccountAttributes",
                          + "ec2:DeleteTags",
                          + "ec2:DeleteSecurityGroup",
                          + "ec2:CreateTags",
                          + "ec2:CreateSecurityGroup",
                          + "ec2:AuthorizeSecurityGroupIngress",
                          + "cognito-idp:DescribeUserPoolClient",
                          + "acm:ListCertificates",
                          + "acm:GetCertificate",
                          + "acm:DescribeCertificate",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # module.alb_ingress.kubernetes_namespace.this will be created
  + resource "kubernetes_namespace" "this" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "ingress-system"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.alb_ingress.local_file.this will be created
  + resource "local_file" "this" {
      + content              = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./apps/aws-alb-ingress-controller.yaml"
      + id                   = (known after apply)
    }

  # module.argocd.data.aws_eks_cluster.this will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_cluster" "this"  {
      + arn                       = (known after apply)
      + certificate_authority     = (known after apply)
      + created_at                = (known after apply)
      + enabled_cluster_log_types = (known after apply)
      + endpoint                  = (known after apply)
      + id                        = (known after apply)
      + identity                  = (known after apply)
      + name                      = (known after apply)
      + platform_version          = (known after apply)
      + role_arn                  = (known after apply)
      + status                    = (known after apply)
      + tags                      = (known after apply)
      + version                   = (known after apply)
      + vpc_config                = (known after apply)
    }

  # module.argocd.data.aws_iam_policy_document.this will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "this"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "kms:Decrypt",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "ArgoCDOwn"
        }
    }

  # module.argocd.aws_iam_policy.this will be created
  + resource "aws_iam_policy" "this" {
      + arn         = (known after apply)
      + description = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "argocd"
      + path        = "/"
      + policy      = (known after apply)
    }

  # module.argocd.aws_kms_ciphertext.client_secret will be created
  + resource "aws_kms_ciphertext" "client_secret" {
      + ciphertext_blob = (known after apply)
      + id              = (known after apply)
      + key_id          = (known after apply)
      + plaintext       = (sensitive value)
    }

  # module.argocd.aws_kms_key.this will be created
  + resource "aws_kms_key" "this" {
      + arn                      = (known after apply)
      + customer_master_key_spec = "SYMMETRIC_DEFAULT"
      + description              = "ArgoCD key"
      + enable_key_rotation      = false
      + id                       = (known after apply)
      + is_enabled               = true
      + key_id                   = (known after apply)
      + key_usage                = "ENCRYPT_DECRYPT"
      + policy                   = (known after apply)
    }

  # module.argocd.aws_ssm_parameter.this will be created
  + resource "aws_ssm_parameter" "this" {
      + arn         = (known after apply)
      + description = (known after apply)
      + id          = (known after apply)
      + key_id      = (known after apply)
      + name        = (known after apply)
      + tier        = "Standard"
      + type        = "SecureString"
      + value       = (sensitive value)
      + version     = (known after apply)
    }

  # module.argocd.helm_release.this will be created
  + resource "helm_release" "this" {
      + atomic                     = false
      + chart                      = "argo-cd"
      + cleanup_on_fail            = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "argocd"
      + namespace                  = "argocd"
      + recreate_pods              = true
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://argoproj.github.io/argo-helm"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 1200
      + verify                     = false
      + version                    = "2.7.4"
      + wait                       = true

      + set {
          + name  = (known after apply)
          + value = (known after apply)
        }
    }

  # module.argocd.kubernetes_config_map.decryptor will be created
  + resource "kubernetes_config_map" "decryptor" {
      + data = (known after apply)
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "argocd-decryptor"
          + namespace        = "argocd"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.argocd.kubernetes_namespace.this will be created
  + resource "kubernetes_namespace" "this" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "argocd"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.argocd.local_file.this will be created
  + resource "local_file" "this" {
      + content              = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./apps/argocd.yaml"
      + id                   = (known after apply)
    }

  # module.argocd.random_password.this will be created
  + resource "random_password" "this" {
      + id          = (known after apply)
      + length      = 20
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + result      = (sensitive value)
      + special     = true
      + upper       = true
    }

  # module.cert_manager.data.aws_eks_cluster.this will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_cluster" "this"  {
      + arn                       = (known after apply)
      + certificate_authority     = (known after apply)
      + created_at                = (known after apply)
      + enabled_cluster_log_types = (known after apply)
      + endpoint                  = (known after apply)
      + id                        = (known after apply)
      + identity                  = (known after apply)
      + name                      = (known after apply)
      + platform_version          = (known after apply)
      + role_arn                  = (known after apply)
      + status                    = (known after apply)
      + tags                      = (known after apply)
      + version                   = (known after apply)
      + vpc_config                = (known after apply)
    }

  # module.cert_manager.data.aws_vpc.main will be read during apply
  # (config refers to values not yet known)
 <= data "aws_vpc" "main"  {
      + arn                     = (known after apply)
      + cidr_block              = (known after apply)
      + cidr_block_associations = (known after apply)
      + default                 = (known after apply)
      + dhcp_options_id         = (known after apply)
      + enable_dns_hostnames    = (known after apply)
      + enable_dns_support      = (known after apply)
      + id                      = (known after apply)
      + instance_tenancy        = (known after apply)
      + ipv6_association_id     = (known after apply)
      + ipv6_cidr_block         = (known after apply)
      + main_route_table_id     = (known after apply)
      + owner_id                = (known after apply)
      + state                   = (known after apply)
      + tags                    = (known after apply)
    }

  # module.cert_manager.aws_iam_policy.this will be created
  + resource "aws_iam_policy" "this" {
      + arn         = (known after apply)
      + description = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = (known after apply)
    }

  # module.cert_manager.kubernetes_namespace.this will be created
  + resource "kubernetes_namespace" "this" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "cert-manager"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.cert_manager.local_file.issuers["prod"] will be created
  + resource "local_file" "issuers" {
      + content              = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./apps/issuers/cert-manager-prod.yaml"
      + id                   = (known after apply)
    }

  # module.cert_manager.local_file.issuers["staging"] will be created
  + resource "local_file" "issuers" {
      + content              = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./apps/issuers/cert-manager-staging.yaml"
      + id                   = (known after apply)
    }

  # module.cert_manager.local_file.issuers_bom will be created
  + resource "local_file" "issuers_bom" {
      + content              = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./apps/cert-manager-issuers.yaml"
      + id                   = (known after apply)
    }

  # module.cert_manager.local_file.this will be created
  + resource "local_file" "this" {
      + content              = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./apps/cert-manager.yaml"
      + id                   = (known after apply)
    }

  # module.cluster_autoscaler.data.aws_eks_cluster.this will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_cluster" "this"  {
      + arn                       = (known after apply)
      + certificate_authority     = (known after apply)
      + created_at                = (known after apply)
      + enabled_cluster_log_types = (known after apply)
      + endpoint                  = (known after apply)
      + id                        = (known after apply)
      + identity                  = (known after apply)
      + name                      = (known after apply)
      + platform_version          = (known after apply)
      + role_arn                  = (known after apply)
      + status                    = (known after apply)
      + tags                      = (known after apply)
      + version                   = (known after apply)
      + vpc_config                = (known after apply)
    }

  # module.cluster_autoscaler.data.aws_iam_policy_document.cluster_autoscaler will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "cluster_autoscaler"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "autoscaling:DescribeAutoScalingGroups",
              + "autoscaling:DescribeAutoScalingInstances",
              + "autoscaling:DescribeLaunchConfigurations",
              + "autoscaling:DescribeTags",
              + "ec2:DescribeLaunchTemplateVersions",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
          + sid       = "clusterAutoscalerAll"
        }
      + statement {
          + actions   = [
              + "autoscaling:SetDesiredCapacity",
              + "autoscaling:TerminateInstanceInAutoScalingGroup",
              + "autoscaling:UpdateAutoScalingGroup",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
          + sid       = "clusterAutoscalerOwn"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "owned",
                ]
              + variable = (known after apply)
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "true",
                ]
              + variable = "autoscaling:ResourceTag/k8s.io/cluster-autoscaler/enabled"
            }
        }
    }

  # module.cluster_autoscaler.aws_iam_policy.cluster_autoscaler will be created
  + resource "aws_iam_policy" "cluster_autoscaler" {
      + arn         = (known after apply)
      + description = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "cluster-autoscaler"
      + path        = "/"
      + policy      = (known after apply)
    }

  # module.cluster_autoscaler.local_file.this will be created
  + resource "local_file" "this" {
      + content              = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./apps/aws-cluster-autoscaler-chart.yaml"
      + id                   = (known after apply)
    }

  # module.cognito.aws_cognito_user_pool.this will be created
  + resource "aws_cognito_user_pool" "this" {
      + arn                        = (known after apply)
      + creation_date              = (known after apply)
      + email_verification_message = (known after apply)
      + email_verification_subject = (known after apply)
      + endpoint                   = (known after apply)
      + id                         = (known after apply)
      + last_modified_date         = (known after apply)
      + mfa_configuration          = "OFF"
      + name                       = (known after apply)
      + sms_verification_message   = (known after apply)

      + admin_create_user_config {
          + unused_account_validity_days = (known after apply)

          + invite_message_template {
              + email_message = <<~EOT
                    Your SAK Kubeflow username is {username} and temporary password is {####}.
                    Please follow the URL to access Kubeflow: https://kubeflow.sak.devops100.com
                EOT
              + email_subject = "Your SAK Kubeflow temporary password"
              + sms_message   = "Your SAK Kubeflow username is {username} and temporary password is {####}"
            }
        }

      + lambda_config {
          + create_auth_challenge          = (known after apply)
          + custom_message                 = (known after apply)
          + define_auth_challenge          = (known after apply)
          + post_authentication            = (known after apply)
          + post_confirmation              = (known after apply)
          + pre_authentication             = (known after apply)
          + pre_sign_up                    = (known after apply)
          + pre_token_generation           = (known after apply)
          + user_migration                 = (known after apply)
          + verify_auth_challenge_response = (known after apply)
        }

      + password_policy {
          + minimum_length                   = (known after apply)
          + require_lowercase                = (known after apply)
          + require_numbers                  = (known after apply)
          + require_symbols                  = (known after apply)
          + require_uppercase                = (known after apply)
          + temporary_password_validity_days = (known after apply)
        }

      + sms_configuration {
          + external_id    = (known after apply)
          + sns_caller_arn = (known after apply)
        }

      + verification_message_template {
          + default_email_option  = (known after apply)
          + email_message         = (known after apply)
          + email_message_by_link = (known after apply)
          + email_subject         = (known after apply)
          + email_subject_by_link = (known after apply)
          + sms_message           = (known after apply)
        }
    }

  # module.cognito.aws_cognito_user_pool_domain.this will be created
  + resource "aws_cognito_user_pool_domain" "this" {
      + aws_account_id              = (known after apply)
      + certificate_arn             = (known after apply)
      + cloudfront_distribution_arn = (known after apply)
      + domain                      = "auth.sak.devops100.com"
      + id                          = (known after apply)
      + s3_bucket                   = (known after apply)
      + user_pool_id                = (known after apply)
      + version                     = (known after apply)
    }

  # module.cognito.aws_route53_record.root will be created
  + resource "aws_route53_record" "root" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "sak.devops100.com"
      + records         = [
          + "127.0.0.1",
        ]
      + ttl             = 60
      + type            = "A"
      + zone_id         = (known after apply)
    }

  # module.cognito.aws_route53_record.this will be created
  + resource "aws_route53_record" "this" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "auth.sak.devops100.com"
      + type            = "A"
      + zone_id         = (known after apply)

      + alias {
          + evaluate_target_health = false
          + name                   = (known after apply)
          + zone_id                = "Z2FDTNDATAQYW2"
        }
    }

  # module.external_dns.data.aws_eks_cluster.this will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_cluster" "this"  {
      + arn                       = (known after apply)
      + certificate_authority     = (known after apply)
      + created_at                = (known after apply)
      + enabled_cluster_log_types = (known after apply)
      + endpoint                  = (known after apply)
      + id                        = (known after apply)
      + identity                  = (known after apply)
      + name                      = (known after apply)
      + platform_version          = (known after apply)
      + role_arn                  = (known after apply)
      + status                    = (known after apply)
      + tags                      = (known after apply)
      + version                   = (known after apply)
      + vpc_config                = (known after apply)
    }

  # module.external_dns.data.aws_vpc.main will be read during apply
  # (config refers to values not yet known)
 <= data "aws_vpc" "main"  {
      + arn                     = (known after apply)
      + cidr_block              = (known after apply)
      + cidr_block_associations = (known after apply)
      + default                 = (known after apply)
      + dhcp_options_id         = (known after apply)
      + enable_dns_hostnames    = (known after apply)
      + enable_dns_support      = (known after apply)
      + id                      = (known after apply)
      + instance_tenancy        = (known after apply)
      + ipv6_association_id     = (known after apply)
      + ipv6_cidr_block         = (known after apply)
      + main_route_table_id     = (known after apply)
      + owner_id                = (known after apply)
      + state                   = (known after apply)
      + tags                    = (known after apply)
    }

  # module.external_dns.aws_iam_policy.this will be created
  + resource "aws_iam_policy" "this" {
      + arn         = (known after apply)
      + description = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = (known after apply)
    }

  # module.external_dns.aws_route53_record.ns[0] will be created
  + resource "aws_route53_record" "ns" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "sak.devops100.com"
      + records         = (known after apply)
      + ttl             = 30
      + type            = "NS"
      + zone_id         = "Z0552891G294KXTRE1DR"
    }

  # module.external_dns.aws_route53_zone.public[0] will be created
  + resource "aws_route53_zone" "public" {
      + comment       = "Managed by Terraform"
      + force_destroy = true
      + id            = (known after apply)
      + name          = "sak.devops100.com"
      + name_servers  = (known after apply)
      + tags          = {
          + "Environment" = "test1"
          + "Project"     = "Kubeflow"
        }
      + vpc_id        = (known after apply)
      + vpc_region    = (known after apply)
      + zone_id       = (known after apply)
    }

  # module.external_dns.local_file.this will be created
  + resource "local_file" "this" {
      + content              = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./apps/external-dns.yaml"
      + id                   = (known after apply)
    }

  # module.kubeflow.local_file.ingress will be created
  + resource "local_file" "ingress" {
      + content              = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./apps/kfdefs/ingress.yaml"
      + id                   = (known after apply)
    }

  # module.kubeflow.local_file.issuer will be created
  + resource "local_file" "issuer" {
      + content              = <<~EOT
            "apiVersion": "cert-manager.io/v1alpha2"
            "kind": "ClusterIssuer"
            "metadata":
              "name": "kubeflow-self-signing-issuer"
            "spec":
              "selfSigned": {}
        EOT
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./apps/kfdefs/issuer.yaml"
      + id                   = (known after apply)
    }

  # module.kubeflow.local_file.kfdef will be created
  + resource "local_file" "kfdef" {
      + content              = <<~EOT
            "apiVersion": "kfdef.apps.kubeflow.org/v1"
            "kind": "KfDef"
            "metadata":
              "name": "kubeflow"
              "namespace": "kubeflow"
            "spec":
              "applications":
              - "kustomizeConfig":
                  "repoRef":
                    "name": "manifests"
                    "path": "application/v3"
                "name": "application"
              - "kustomizeConfig":
                  "repoRef":
                    "name": "manifests"
                    "path": "stacks/aws/application/istio-stack"
                "name": "istio-stack"
              - "kustomizeConfig":
                  "repoRef":
                    "name": "manifests"
                    "path": "stacks/aws/application/cluster-local-gateway"
                "name": "cluster-local-gateway"
              - "kustomizeConfig":
                  "repoRef":
                    "name": "manifests"
                    "path": "stacks/aws/application/istio"
                "name": "istio"
              - "kustomizeConfig":
                  "repoRef":
                    "name": "manifests"
                    "path": "metacontroller/base"
                "name": "metacontroller"
              - "kustomizeConfig":
                  "repoRef":
                    "name": "manifests"
                    "path": "admission-webhook/bootstrap/overlays/application"
                "name": "bootstrap"
              - "kustomizeConfig":
                  "repoRef":
                    "name": "manifests"
                    "path": "stacks/kubernetes"
                "name": "kubeflow-apps"
              - "kustomizeConfig":
                  "repoRef":
                    "name": "manifests"
                    "path": "knative/installs/generic"
                "name": "knative"
              - "kustomizeConfig":
                  "repoRef":
                    "name": "manifests"
                    "path": "kfserving/installs/generic"
                "name": "kfserving"
              - "kustomizeConfig":
                  "repoRef":
                    "name": "manifests"
                    "path": "aws/aws-istio-authz-adaptor/base_v3"
                "name": "aws-istio-authz-adaptor"
              "repos":
              - "name": "manifests"
                "uri": "https://github.com/kubeflow/manifests/archive/v1.2-branch.tar.gz"
              "version": "v1.2-branch"
        EOT
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./apps/kfdefs/v1.1.0.yaml"
      + id                   = (known after apply)
    }

  # module.kubeflow.local_file.kubeflow will be created
  + resource "local_file" "kubeflow" {
      + content              = <<~EOT
            "apiVersion": "argoproj.io/v1alpha1"
            "kind": "Application"
            "metadata":
              "name": "kubeflow"
              "namespace": "argocd"
            "spec":
              "destination":
                "namespace": "kubeflow"
                "server": "https://kubernetes.default.svc"
              "project": "default"
              "source":
                "path": "apps/kfdefs"
                "repoURL": "https://github.com/devops100/sak-kubeflow"
                "targetRevision": "init"
              "syncPolicy":
                "automated":
                  "prune": true
                  "selfHeal": true
                "syncOptions":
                - "CreateNamespace=false"
        EOT
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./apps/kubeflow.yaml"
      + id                   = (known after apply)
    }

  # module.kubeflow.local_file.kubeflow_operator will be created
  + resource "local_file" "kubeflow_operator" {
      + content              = <<~EOT
            "apiVersion": "argoproj.io/v1alpha1"
            "kind": "Application"
            "metadata":
              "name": "kubeflow-operator"
              "namespace": "argocd"
            "spec":
              "destination":
                "namespace": "operators"
                "server": "https://kubernetes.default.svc"
              "project": "default"
              "source":
                "kustomize":
                  "images":
                  - "aipipeline/kubeflow-operator=provectuslabs/kubeflow-operator:master"
                "path": "deploy"
                "repoURL": "https://github.com/kubeflow/kfctl"
                "targetRevision": "v1.2-branch"
              "syncPolicy":
                "automated":
                  "prune": true
                  "selfHeal": true
                "syncOptions":
                - "CreateNamespace=true"
        EOT
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./apps/kubeflow-operator.yaml"
      + id                   = (known after apply)
    }

  # module.kubeflow.local_file.namespace will be created
  + resource "local_file" "namespace" {
      + content              = <<~EOT
            "apiVersion": "v1"
            "kind": "Namespace"
            "metadata":
              "labels":
                "control-plane": "kubeflow"
                "istio-injection": "enabled"
              "name": "kubeflow"
        EOT
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./apps/kubeflow-namespace.yaml"
      + id                   = (known after apply)
    }

  # module.kubernetes.aws_iam_openid_connect_provider.this will be created
  + resource "aws_iam_openid_connect_provider" "this" {
      + arn             = (known after apply)
      + client_id_list  = [
          + "sts.amazonaws.com",
        ]
      + id              = (known after apply)
      + thumbprint_list = [
          + "9e99a48a9960b14926bb7f3b02e22da2b0ab7280",
        ]
      + url             = (known after apply)
    }

  # module.alb_ingress.module.iam_assumable_role_admin.data.aws_iam_policy_document.assume_role_with_oidc[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "assume_role_with_oidc"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions = (known after apply)
          + effect  = (known after apply)

          + condition {
              + test     = (known after apply)
              + values   = (known after apply)
              + variable = (known after apply)
            }

          + principals {
              + identifiers = (known after apply)
              + type        = (known after apply)
            }
        }
    }

  # module.alb_ingress.module.iam_assumable_role_admin.aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + path                  = "/"
      + unique_id             = (known after apply)
    }

  # module.alb_ingress.module.iam_assumable_role_admin.aws_iam_role_policy_attachment.custom[0] will be created
  + resource "aws_iam_role_policy_attachment" "custom" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.argocd.module.iam_assumable_role_admin.data.aws_iam_policy_document.assume_role_with_oidc[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "assume_role_with_oidc"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "system:serviceaccount:argocd:argocd",
                ]
              + variable = (known after apply)
            }

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "Federated"
            }
        }
    }

  # module.argocd.module.iam_assumable_role_admin.aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + path                  = "/"
      + unique_id             = (known after apply)
    }

  # module.argocd.module.iam_assumable_role_admin.aws_iam_role_policy_attachment.custom[0] will be created
  + resource "aws_iam_role_policy_attachment" "custom" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.cert_manager.module.iam_assumable_role_admin.data.aws_iam_policy_document.assume_role_with_oidc[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "assume_role_with_oidc"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + (known after apply),
                ]
              + variable = (known after apply)
            }

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "Federated"
            }
        }
    }

  # module.cert_manager.module.iam_assumable_role_admin.aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "test1"
          + "Project"     = "Kubeflow"
        }
      + unique_id             = (known after apply)
    }

  # module.cert_manager.module.iam_assumable_role_admin.aws_iam_role_policy_attachment.custom[0] will be created
  + resource "aws_iam_role_policy_attachment" "custom" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.cluster_autoscaler.module.iam_assumable_role_admin.data.aws_iam_policy_document.assume_role_with_oidc[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "assume_role_with_oidc"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "system:serviceaccount:kube-system:aws-cluster-autoscaler-chart",
                ]
              + variable = (known after apply)
            }

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "Federated"
            }
        }
    }

  # module.cluster_autoscaler.module.iam_assumable_role_admin.aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + path                  = "/"
      + unique_id             = (known after apply)
    }

  # module.cluster_autoscaler.module.iam_assumable_role_admin.aws_iam_role_policy_attachment.custom[0] will be created
  + resource "aws_iam_role_policy_attachment" "custom" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.cognito.module.cognito_acm.aws_acm_certificate.this[0] will be created
  + resource "aws_acm_certificate" "this" {
      + arn                       = (known after apply)
      + domain_name               = "auth.sak.devops100.com"
      + domain_validation_options = (known after apply)
      + id                        = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = []
      + tags                      = {
          + "environment" = "test1"
          + "project"     = "Kubeflow"
        }
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"

      + options {
          + certificate_transparency_logging_preference = "ENABLED"
        }
    }

  # module.cognito.module.cognito_acm.aws_acm_certificate_validation.this[0] will be created
  + resource "aws_acm_certificate_validation" "this" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # module.cognito.module.cognito_acm.aws_route53_record.validation[0] will be created
  + resource "aws_route53_record" "validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = (known after apply)
    }

  # module.external_dns.module.iam_assumable_role_admin.data.aws_iam_policy_document.assume_role_with_oidc[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "assume_role_with_oidc"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "system:serviceaccount:kube-system:external-dns",
                ]
              + variable = (known after apply)
            }

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "Federated"
            }
        }
    }

  # module.external_dns.module.iam_assumable_role_admin.aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "test1"
          + "Project"     = "Kubeflow"
        }
      + unique_id             = (known after apply)
    }

  # module.external_dns.module.iam_assumable_role_admin.aws_iam_role_policy_attachment.custom[0] will be created
  + resource "aws_iam_role_policy_attachment" "custom" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.kubernetes.module.eks.data.null_data_source.node_groups[0] will be read during apply
  # (config refers to values not yet known)
 <= data "null_data_source" "node_groups"  {
      + has_computed_default = (known after apply)
      + id                   = (known after apply)
      + inputs               = {
          + "aws_auth"        = (known after apply)
          + "cluster_name"    = "devops10020220218"
          + "role_CNI_Policy" = (known after apply)
          + "role_Container"  = (known after apply)
          + "role_NodePolicy" = (known after apply)
        }
      + outputs              = (known after apply)
      + random               = (known after apply)
    }

  # module.kubernetes.module.eks.aws_autoscaling_group.workers_launch_template[0] will be created
  + resource "aws_autoscaling_group" "workers_launch_template" {
      + arn                       = (known after apply)
      + availability_zones        = (known after apply)
      + default_cooldown          = (known after apply)
      + desired_capacity          = (known after apply)
      + enabled_metrics           = (known after apply)
      + force_delete              = (known after apply)
      + health_check_grace_period = (known after apply)
      + health_check_type         = (known after apply)
      + id                        = (known after apply)
      + load_balancers            = (known after apply)
      + max_instance_lifetime     = (known after apply)
      + max_size                  = (known after apply)
      + metrics_granularity       = "1Minute"
      + min_size                  = (known after apply)
      + name                      = (known after apply)
      + name_prefix               = (known after apply)
      + placement_group           = (known after apply)
      + protect_from_scale_in     = (known after apply)
      + service_linked_role_arn   = (known after apply)
      + suspended_processes       = (known after apply)
      + tags                      = (known after apply)
      + target_group_arns         = (known after apply)
      + termination_policies      = (known after apply)
      + vpc_zone_identifier       = (known after apply)
      + wait_for_capacity_timeout = "10m"

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = (known after apply)
        }

      + mixed_instances_policy {
          + instances_distribution {
              + on_demand_allocation_strategy            = (known after apply)
              + on_demand_base_capacity                  = (known after apply)
              + on_demand_percentage_above_base_capacity = (known after apply)
              + spot_allocation_strategy                 = (known after apply)
              + spot_instance_pools                      = (known after apply)
              + spot_max_price                           = (known after apply)
            }

          + launch_template {
              + launch_template_specification {
                  + launch_template_id   = (known after apply)
                  + launch_template_name = (known after apply)
                  + version              = (known after apply)
                }

              + override {
                  + instance_type = (known after apply)
                }
            }
        }
    }

  # module.kubernetes.module.eks.aws_autoscaling_group.workers_launch_template[1] will be created
  + resource "aws_autoscaling_group" "workers_launch_template" {
      + arn                       = (known after apply)
      + availability_zones        = (known after apply)
      + default_cooldown          = (known after apply)
      + desired_capacity          = (known after apply)
      + enabled_metrics           = (known after apply)
      + force_delete              = (known after apply)
      + health_check_grace_period = (known after apply)
      + health_check_type         = (known after apply)
      + id                        = (known after apply)
      + load_balancers            = (known after apply)
      + max_instance_lifetime     = (known after apply)
      + max_size                  = (known after apply)
      + metrics_granularity       = "1Minute"
      + min_size                  = (known after apply)
      + name                      = (known after apply)
      + name_prefix               = (known after apply)
      + placement_group           = (known after apply)
      + protect_from_scale_in     = (known after apply)
      + service_linked_role_arn   = (known after apply)
      + suspended_processes       = (known after apply)
      + tags                      = (known after apply)
      + target_group_arns         = (known after apply)
      + termination_policies      = (known after apply)
      + vpc_zone_identifier       = (known after apply)
      + wait_for_capacity_timeout = "10m"

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = (known after apply)
        }

      + mixed_instances_policy {
          + instances_distribution {
              + on_demand_allocation_strategy            = (known after apply)
              + on_demand_base_capacity                  = (known after apply)
              + on_demand_percentage_above_base_capacity = (known after apply)
              + spot_allocation_strategy                 = (known after apply)
              + spot_instance_pools                      = (known after apply)
              + spot_max_price                           = (known after apply)
            }

          + launch_template {
              + launch_template_specification {
                  + launch_template_id   = (known after apply)
                  + launch_template_name = (known after apply)
                  + version              = (known after apply)
                }

              + override {
                  + instance_type = (known after apply)
                }
            }
        }
    }

  # module.kubernetes.module.eks.aws_autoscaling_group.workers_launch_template[2] will be created
  + resource "aws_autoscaling_group" "workers_launch_template" {
      + arn                       = (known after apply)
      + availability_zones        = (known after apply)
      + default_cooldown          = (known after apply)
      + desired_capacity          = (known after apply)
      + enabled_metrics           = (known after apply)
      + force_delete              = (known after apply)
      + health_check_grace_period = (known after apply)
      + health_check_type         = (known after apply)
      + id                        = (known after apply)
      + load_balancers            = (known after apply)
      + max_instance_lifetime     = (known after apply)
      + max_size                  = (known after apply)
      + metrics_granularity       = "1Minute"
      + min_size                  = (known after apply)
      + name                      = (known after apply)
      + name_prefix               = (known after apply)
      + placement_group           = (known after apply)
      + protect_from_scale_in     = (known after apply)
      + service_linked_role_arn   = (known after apply)
      + suspended_processes       = (known after apply)
      + tags                      = (known after apply)
      + target_group_arns         = (known after apply)
      + termination_policies      = (known after apply)
      + vpc_zone_identifier       = (known after apply)
      + wait_for_capacity_timeout = "10m"

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = (known after apply)
        }

      + mixed_instances_policy {
          + instances_distribution {
              + on_demand_allocation_strategy            = (known after apply)
              + on_demand_base_capacity                  = (known after apply)
              + on_demand_percentage_above_base_capacity = (known after apply)
              + spot_allocation_strategy                 = (known after apply)
              + spot_instance_pools                      = (known after apply)
              + spot_max_price                           = (known after apply)
            }

          + launch_template {
              + launch_template_specification {
                  + launch_template_id   = (known after apply)
                  + launch_template_name = (known after apply)
                  + version              = (known after apply)
                }

              + override {
                  + instance_type = (known after apply)
                }
            }
        }
    }

  # module.kubernetes.module.eks.aws_autoscaling_group.workers_launch_template[3] will be created
  + resource "aws_autoscaling_group" "workers_launch_template" {
      + arn                       = (known after apply)
      + availability_zones        = (known after apply)
      + default_cooldown          = (known after apply)
      + desired_capacity          = (known after apply)
      + enabled_metrics           = (known after apply)
      + force_delete              = (known after apply)
      + health_check_grace_period = (known after apply)
      + health_check_type         = (known after apply)
      + id                        = (known after apply)
      + load_balancers            = (known after apply)
      + max_instance_lifetime     = (known after apply)
      + max_size                  = (known after apply)
      + metrics_granularity       = "1Minute"
      + min_size                  = (known after apply)
      + name                      = (known after apply)
      + name_prefix               = (known after apply)
      + placement_group           = (known after apply)
      + protect_from_scale_in     = (known after apply)
      + service_linked_role_arn   = (known after apply)
      + suspended_processes       = (known after apply)
      + tags                      = (known after apply)
      + target_group_arns         = (known after apply)
      + termination_policies      = (known after apply)
      + vpc_zone_identifier       = (known after apply)
      + wait_for_capacity_timeout = "10m"

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = (known after apply)
        }

      + mixed_instances_policy {
          + instances_distribution {
              + on_demand_allocation_strategy            = (known after apply)
              + on_demand_base_capacity                  = (known after apply)
              + on_demand_percentage_above_base_capacity = (known after apply)
              + spot_allocation_strategy                 = (known after apply)
              + spot_instance_pools                      = (known after apply)
              + spot_max_price                           = (known after apply)
            }

          + launch_template {
              + launch_template_specification {
                  + launch_template_id   = (known after apply)
                  + launch_template_name = (known after apply)
                  + version              = (known after apply)
                }

              + override {
                  + instance_type = (known after apply)
                }
            }
        }
    }

  # module.kubernetes.module.eks.aws_autoscaling_group.workers_launch_template[4] will be created
  + resource "aws_autoscaling_group" "workers_launch_template" {
      + arn                       = (known after apply)
      + availability_zones        = (known after apply)
      + default_cooldown          = (known after apply)
      + desired_capacity          = (known after apply)
      + enabled_metrics           = (known after apply)
      + force_delete              = (known after apply)
      + health_check_grace_period = (known after apply)
      + health_check_type         = (known after apply)
      + id                        = (known after apply)
      + load_balancers            = (known after apply)
      + max_instance_lifetime     = (known after apply)
      + max_size                  = (known after apply)
      + metrics_granularity       = "1Minute"
      + min_size                  = (known after apply)
      + name                      = (known after apply)
      + name_prefix               = (known after apply)
      + placement_group           = (known after apply)
      + protect_from_scale_in     = (known after apply)
      + service_linked_role_arn   = (known after apply)
      + suspended_processes       = (known after apply)
      + tags                      = (known after apply)
      + target_group_arns         = (known after apply)
      + termination_policies      = (known after apply)
      + vpc_zone_identifier       = (known after apply)
      + wait_for_capacity_timeout = "10m"

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = (known after apply)
        }

      + mixed_instances_policy {
          + instances_distribution {
              + on_demand_allocation_strategy            = (known after apply)
              + on_demand_base_capacity                  = (known after apply)
              + on_demand_percentage_above_base_capacity = (known after apply)
              + spot_allocation_strategy                 = (known after apply)
              + spot_instance_pools                      = (known after apply)
              + spot_max_price                           = (known after apply)
            }

          + launch_template {
              + launch_template_specification {
                  + launch_template_id   = (known after apply)
                  + launch_template_name = (known after apply)
                  + version              = (known after apply)
                }

              + override {
                  + instance_type = (known after apply)
                }
            }
        }
    }

  # module.kubernetes.module.eks.aws_eks_cluster.this[0] will be created
  + resource "aws_eks_cluster" "this" {
      + arn                   = (known after apply)
      + certificate_authority = (known after apply)
      + created_at            = (known after apply)
      + endpoint              = (known after apply)
      + id                    = (known after apply)
      + identity              = (known after apply)
      + name                  = "devops10020220218"
      + platform_version      = (known after apply)
      + role_arn              = (known after apply)
      + status                = (known after apply)
      + tags                  = {
          + "Environment" = "test1"
          + "Project"     = "Kubeflow"
        }
      + version               = "1.21"

      + timeouts {
          + create = "30m"
          + delete = "15m"
        }

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = false
          + endpoint_public_access    = true
          + public_access_cidrs       = [
              + "0.0.0.0/0",
            ]
          + security_group_ids        = (known after apply)
          + subnet_ids                = (known after apply)
          + vpc_id                    = (known after apply)
        }
    }

  # module.kubernetes.module.eks.aws_iam_instance_profile.workers_launch_template[0] will be created
  + resource "aws_iam_instance_profile" "workers_launch_template" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "devops10020220218"
      + path        = "/"
      + role        = (known after apply)
      + roles       = (known after apply)
      + unique_id   = (known after apply)
    }

  # module.kubernetes.module.eks.aws_iam_instance_profile.workers_launch_template[1] will be created
  + resource "aws_iam_instance_profile" "workers_launch_template" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "devops10020220218"
      + path        = "/"
      + role        = (known after apply)
      + roles       = (known after apply)
      + unique_id   = (known after apply)
    }

  # module.kubernetes.module.eks.aws_iam_instance_profile.workers_launch_template[2] will be created
  + resource "aws_iam_instance_profile" "workers_launch_template" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "devops10020220218"
      + path        = "/"
      + role        = (known after apply)
      + roles       = (known after apply)
      + unique_id   = (known after apply)
    }

  # module.kubernetes.module.eks.aws_iam_instance_profile.workers_launch_template[3] will be created
  + resource "aws_iam_instance_profile" "workers_launch_template" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "devops10020220218"
      + path        = "/"
      + role        = (known after apply)
      + roles       = (known after apply)
      + unique_id   = (known after apply)
    }

  # module.kubernetes.module.eks.aws_iam_instance_profile.workers_launch_template[4] will be created
  + resource "aws_iam_instance_profile" "workers_launch_template" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "devops10020220218"
      + path        = "/"
      + role        = (known after apply)
      + roles       = (known after apply)
      + unique_id   = (known after apply)
    }

  # module.kubernetes.module.eks.aws_iam_role.cluster[0] will be created
  + resource "aws_iam_role" "cluster" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks.amazonaws.com"
                        }
                      + Sid       = "EKSClusterAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "devops10020220218"
      + path                  = "/"
      + tags                  = {
          + "Environment" = "test1"
          + "Project"     = "Kubeflow"
        }
      + unique_id             = (known after apply)
    }

  # module.kubernetes.module.eks.aws_iam_role.workers[0] will be created
  + resource "aws_iam_role" "workers" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = "EKSWorkerAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "devops10020220218"
      + path                  = "/"
      + tags                  = {
          + "Environment" = "test1"
          + "Project"     = "Kubeflow"
        }
      + unique_id             = (known after apply)
    }

  # module.kubernetes.module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSClusterPolicy[0] will be created
  + resource "aws_iam_role_policy_attachment" "cluster_AmazonEKSClusterPolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      + role       = (known after apply)
    }

  # module.kubernetes.module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSServicePolicy[0] will be created
  + resource "aws_iam_role_policy_attachment" "cluster_AmazonEKSServicePolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSServicePolicy"
      + role       = (known after apply)
    }

  # module.kubernetes.module.eks.aws_iam_role_policy_attachment.workers_AmazonEC2ContainerRegistryReadOnly[0] will be created
  + resource "aws_iam_role_policy_attachment" "workers_AmazonEC2ContainerRegistryReadOnly" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = (known after apply)
    }

  # module.kubernetes.module.eks.aws_iam_role_policy_attachment.workers_AmazonEKSWorkerNodePolicy[0] will be created
  + resource "aws_iam_role_policy_attachment" "workers_AmazonEKSWorkerNodePolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      + role       = (known after apply)
    }

  # module.kubernetes.module.eks.aws_iam_role_policy_attachment.workers_AmazonEKS_CNI_Policy[0] will be created
  + resource "aws_iam_role_policy_attachment" "workers_AmazonEKS_CNI_Policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = (known after apply)
    }

  # module.kubernetes.module.eks.aws_iam_role_policy_attachment.workers_additional_policies[0] will be created
  + resource "aws_iam_role_policy_attachment" "workers_additional_policies" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
      + role       = (known after apply)
    }

  # module.kubernetes.module.eks.aws_launch_template.workers_launch_template[0] will be created
  + resource "aws_launch_template" "workers_launch_template" {
      + arn             = (known after apply)
      + default_version = (known after apply)
      + ebs_optimized   = (known after apply)
      + id              = (known after apply)
      + image_id        = (known after apply)
      + instance_type   = (known after apply)
      + key_name        = (known after apply)
      + latest_version  = (known after apply)
      + name            = (known after apply)
      + name_prefix     = (known after apply)
      + tags            = {
          + "Environment" = "test1"
          + "Project"     = "Kubeflow"
        }
      + user_data       = (known after apply)

      + block_device_mappings {
          + device_name = (known after apply)

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = (known after apply)
              + iops                  = (known after apply)
              + kms_key_id            = (known after apply)
              + volume_size           = (known after apply)
              + volume_type           = (known after apply)
            }
        }
      + block_device_mappings {
          + device_name = (known after apply)

          + ebs {
              + delete_on_termination = (known after apply)
              + encrypted             = (known after apply)
              + iops                  = (known after apply)
              + kms_key_id            = (known after apply)
              + volume_size           = (known after apply)
              + volume_type           = (known after apply)
            }
        }

      + credit_specification {
          + cpu_credits = (known after apply)
        }

      + iam_instance_profile {
          + name = (known after apply)
        }

      + instance_market_options {
          + market_type = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + monitoring {
          + enabled = (known after apply)
        }

      + network_interfaces {
          + associate_public_ip_address = (known after apply)
          + delete_on_termination       = (known after apply)
          + security_groups             = (known after apply)
        }

      + placement {
          + group_name = (known after apply)
          + tenancy    = (known after apply)
        }

      + tag_specifications {
          + resource_type = "volume"
          + tags          = (known after apply)
        }
      + tag_specifications {
          + resource_type = "instance"
          + tags          = (known after apply)
        }
    }

  # module.kubernetes.module.eks.aws_launch_template.workers_launch_template[1] will be created
  + resource "aws_launch_template" "workers_launch_template" {
      + arn             = (known after apply)
      + default_version = (known after apply)
      + ebs_optimized   = (known after apply)
      + id              = (known after apply)
      + image_id        = (known after apply)
      + instance_type   = (known after apply)
      + key_name        = (known after apply)
      + latest_version  = (known after apply)
      + name            = (known after apply)
      + name_prefix     = (known after apply)
      + tags            = {
          + "Environment" = "test1"
          + "Project"     = "Kubeflow"
        }
      + user_data       = (known after apply)

      + block_device_mappings {
          + device_name = (known after apply)

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = (known after apply)
              + iops                  = (known after apply)
              + kms_key_id            = (known after apply)
              + volume_size           = (known after apply)
              + volume_type           = (known after apply)
            }
        }
      + block_device_mappings {
          + device_name = (known after apply)

          + ebs {
              + delete_on_termination = (known after apply)
              + encrypted             = (known after apply)
              + iops                  = (known after apply)
              + kms_key_id            = (known after apply)
              + volume_size           = (known after apply)
              + volume_type           = (known after apply)
            }
        }

      + credit_specification {
          + cpu_credits = (known after apply)
        }

      + iam_instance_profile {
          + name = (known after apply)
        }

      + instance_market_options {
          + market_type = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + monitoring {
          + enabled = (known after apply)
        }

      + network_interfaces {
          + associate_public_ip_address = (known after apply)
          + delete_on_termination       = (known after apply)
          + security_groups             = (known after apply)
        }

      + placement {
          + group_name = (known after apply)
          + tenancy    = (known after apply)
        }

      + tag_specifications {
          + resource_type = "volume"
          + tags          = (known after apply)
        }
      + tag_specifications {
          + resource_type = "instance"
          + tags          = (known after apply)
        }
    }

  # module.kubernetes.module.eks.aws_launch_template.workers_launch_template[2] will be created
  + resource "aws_launch_template" "workers_launch_template" {
      + arn             = (known after apply)
      + default_version = (known after apply)
      + ebs_optimized   = (known after apply)
      + id              = (known after apply)
      + image_id        = (known after apply)
      + instance_type   = (known after apply)
      + key_name        = (known after apply)
      + latest_version  = (known after apply)
      + name            = (known after apply)
      + name_prefix     = (known after apply)
      + tags            = {
          + "Environment" = "test1"
          + "Project"     = "Kubeflow"
        }
      + user_data       = (known after apply)

      + block_device_mappings {
          + device_name = (known after apply)

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = (known after apply)
              + iops                  = (known after apply)
              + kms_key_id            = (known after apply)
              + volume_size           = (known after apply)
              + volume_type           = (known after apply)
            }
        }
      + block_device_mappings {
          + device_name = (known after apply)

          + ebs {
              + delete_on_termination = (known after apply)
              + encrypted             = (known after apply)
              + iops                  = (known after apply)
              + kms_key_id            = (known after apply)
              + volume_size           = (known after apply)
              + volume_type           = (known after apply)
            }
        }

      + credit_specification {
          + cpu_credits = (known after apply)
        }

      + iam_instance_profile {
          + name = (known after apply)
        }

      + instance_market_options {
          + market_type = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + monitoring {
          + enabled = (known after apply)
        }

      + network_interfaces {
          + associate_public_ip_address = (known after apply)
          + delete_on_termination       = (known after apply)
          + security_groups             = (known after apply)
        }

      + placement {
          + group_name = (known after apply)
          + tenancy    = (known after apply)
        }

      + tag_specifications {
          + resource_type = "volume"
          + tags          = (known after apply)
        }
      + tag_specifications {
          + resource_type = "instance"
          + tags          = (known after apply)
        }
    }

  # module.kubernetes.module.eks.aws_launch_template.workers_launch_template[3] will be created
  + resource "aws_launch_template" "workers_launch_template" {
      + arn             = (known after apply)
      + default_version = (known after apply)
      + ebs_optimized   = (known after apply)
      + id              = (known after apply)
      + image_id        = (known after apply)
      + instance_type   = (known after apply)
      + key_name        = (known after apply)
      + latest_version  = (known after apply)
      + name            = (known after apply)
      + name_prefix     = (known after apply)
      + tags            = {
          + "Environment" = "test1"
          + "Project"     = "Kubeflow"
        }
      + user_data       = (known after apply)

      + block_device_mappings {
          + device_name = (known after apply)

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = (known after apply)
              + iops                  = (known after apply)
              + kms_key_id            = (known after apply)
              + volume_size           = (known after apply)
              + volume_type           = (known after apply)
            }
        }
      + block_device_mappings {
          + device_name = (known after apply)

          + ebs {
              + delete_on_termination = (known after apply)
              + encrypted             = (known after apply)
              + iops                  = (known after apply)
              + kms_key_id            = (known after apply)
              + volume_size           = (known after apply)
              + volume_type           = (known after apply)
            }
        }

      + credit_specification {
          + cpu_credits = (known after apply)
        }

      + iam_instance_profile {
          + name = (known after apply)
        }

      + instance_market_options {
          + market_type = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + monitoring {
          + enabled = (known after apply)
        }

      + network_interfaces {
          + associate_public_ip_address = (known after apply)
          + delete_on_termination       = (known after apply)
          + security_groups             = (known after apply)
        }

      + placement {
          + group_name = (known after apply)
          + tenancy    = (known after apply)
        }

      + tag_specifications {
          + resource_type = "volume"
          + tags          = (known after apply)
        }
      + tag_specifications {
          + resource_type = "instance"
          + tags          = (known after apply)
        }
    }

  # module.kubernetes.module.eks.aws_launch_template.workers_launch_template[4] will be created
  + resource "aws_launch_template" "workers_launch_template" {
      + arn             = (known after apply)
      + default_version = (known after apply)
      + ebs_optimized   = (known after apply)
      + id              = (known after apply)
      + image_id        = (known after apply)
      + instance_type   = (known after apply)
      + key_name        = (known after apply)
      + latest_version  = (known after apply)
      + name            = (known after apply)
      + name_prefix     = (known after apply)
      + tags            = {
          + "Environment" = "test1"
          + "Project"     = "Kubeflow"
        }
      + user_data       = (known after apply)

      + block_device_mappings {
          + device_name = (known after apply)

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = (known after apply)
              + iops                  = (known after apply)
              + kms_key_id            = (known after apply)
              + volume_size           = (known after apply)
              + volume_type           = (known after apply)
            }
        }
      + block_device_mappings {
          + device_name = (known after apply)

          + ebs {
              + delete_on_termination = (known after apply)
              + encrypted             = (known after apply)
              + iops                  = (known after apply)
              + kms_key_id            = (known after apply)
              + volume_size           = (known after apply)
              + volume_type           = (known after apply)
            }
        }

      + credit_specification {
          + cpu_credits = (known after apply)
        }

      + iam_instance_profile {
          + name = (known after apply)
        }

      + instance_market_options {
          + market_type = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + monitoring {
          + enabled = (known after apply)
        }

      + network_interfaces {
          + associate_public_ip_address = (known after apply)
          + delete_on_termination       = (known after apply)
          + security_groups             = (known after apply)
        }

      + placement {
          + group_name = (known after apply)
          + tenancy    = (known after apply)
        }

      + tag_specifications {
          + resource_type = "volume"
          + tags          = (known after apply)
        }
      + tag_specifications {
          + resource_type = "instance"
          + tags          = (known after apply)
        }
    }

  # module.kubernetes.module.eks.aws_security_group.cluster[0] will be created
  + resource "aws_security_group" "cluster" {
      + arn                    = (known after apply)
      + description            = "EKS cluster security group."
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "devops10020220218"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment" = "test1"
          + "Name"        = "devops10020220218-eks_cluster_sg"
          + "Project"     = "Kubeflow"
        }
      + vpc_id                 = (known after apply)
    }

  # module.kubernetes.module.eks.aws_security_group.workers[0] will be created
  + resource "aws_security_group" "workers" {
      + arn                    = (known after apply)
      + description            = "Security group for all nodes in the cluster."
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "devops10020220218"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment"                             = "test1"
          + "Name"                                    = "devops10020220218-eks_worker_sg"
          + "Project"                                 = "Kubeflow"
          + "kubernetes.io/cluster/devops10020220218" = "owned"
        }
      + vpc_id                 = (known after apply)
    }

  # module.kubernetes.module.eks.aws_security_group_rule.cluster_egress_internet[0] will be created
  + resource "aws_security_group_rule" "cluster_egress_internet" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow cluster egress access to the Internet."
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.kubernetes.module.eks.aws_security_group_rule.cluster_https_worker_ingress[0] will be created
  + resource "aws_security_group_rule" "cluster_https_worker_ingress" {
      + description              = "Allow pods to communicate with the EKS cluster API."
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.kubernetes.module.eks.aws_security_group_rule.workers_egress_internet[0] will be created
  + resource "aws_security_group_rule" "workers_egress_internet" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow nodes all egress to the Internet."
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.kubernetes.module.eks.aws_security_group_rule.workers_ingress_cluster[0] will be created
  + resource "aws_security_group_rule" "workers_ingress_cluster" {
      + description              = "Allow workers pods to receive communication from the cluster control plane."
      + from_port                = 1025
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 65535
      + type                     = "ingress"
    }

  # module.kubernetes.module.eks.aws_security_group_rule.workers_ingress_cluster_https[0] will be created
  + resource "aws_security_group_rule" "workers_ingress_cluster_https" {
      + description              = "Allow pods running extension API servers on port 443 to receive communication from cluster control plane."
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.kubernetes.module.eks.aws_security_group_rule.workers_ingress_self[0] will be created
  + resource "aws_security_group_rule" "workers_ingress_self" {
      + description              = "Allow node to communicate with each other."
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 65535
      + type                     = "ingress"
    }

  # module.kubernetes.module.eks.kubernetes_config_map.aws_auth[0] will be created
  + resource "kubernetes_config_map" "aws_auth" {
      + data = (known after apply)
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "aws-auth"
          + namespace        = "kube-system"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.kubernetes.module.eks.local_file.kubeconfig[0] will be created
  + resource "local_file" "kubeconfig" {
      + content              = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "./kubeconfig_devops10020220218"
      + id                   = (known after apply)
    }

  # module.kubernetes.module.eks.null_resource.wait_for_cluster[0] will be created
  + resource "null_resource" "wait_for_cluster" {
      + id = (known after apply)
    }

  # module.kubernetes.module.eks.random_pet.workers_launch_template[0] will be created
  + resource "random_pet" "workers_launch_template" {
      + id        = (known after apply)
      + keepers   = (known after apply)
      + length    = 2
      + separator = "-"
    }

  # module.kubernetes.module.eks.random_pet.workers_launch_template[1] will be created
  + resource "random_pet" "workers_launch_template" {
      + id        = (known after apply)
      + keepers   = (known after apply)
      + length    = 2
      + separator = "-"
    }

  # module.kubernetes.module.eks.random_pet.workers_launch_template[2] will be created
  + resource "random_pet" "workers_launch_template" {
      + id        = (known after apply)
      + keepers   = (known after apply)
      + length    = 2
      + separator = "-"
    }

  # module.kubernetes.module.eks.random_pet.workers_launch_template[3] will be created
  + resource "random_pet" "workers_launch_template" {
      + id        = (known after apply)
      + keepers   = (known after apply)
      + length    = 2
      + separator = "-"
    }

  # module.kubernetes.module.eks.random_pet.workers_launch_template[4] will be created
  + resource "random_pet" "workers_launch_template" {
      + id        = (known after apply)
      + keepers   = (known after apply)
      + length    = 2
      + separator = "-"
    }

  # module.network.module.vpc.aws_eip.nat[0] will be created
  + resource "aws_eip" "nat" {
      + allocation_id     = (known after apply)
      + association_id    = (known after apply)
      + customer_owned_ip = (known after apply)
      + domain            = (known after apply)
      + id                = (known after apply)
      + instance          = (known after apply)
      + network_interface = (known after apply)
      + private_dns       = (known after apply)
      + private_ip        = (known after apply)
      + public_dns        = (known after apply)
      + public_ip         = (known after apply)
      + public_ipv4_pool  = (known after apply)
      + tags              = {
          + "Environment" = "test1"
          + "Name"        = "test1-devops10020220218"
          + "Project"     = "Kubeflow"
          + "Terraform"   = "true"
        }
      + vpc               = true
    }

  # module.network.module.vpc.aws_internet_gateway.this[0] will be created
  + resource "aws_internet_gateway" "this" {
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Environment" = "test1"
          + "Name"        = "test1-devops10020220218"
          + "Project"     = "Kubeflow"
          + "Terraform"   = "true"
        }
      + vpc_id   = (known after apply)
    }

  # module.network.module.vpc.aws_nat_gateway.this[0] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id        = (known after apply)
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "Environment" = "test1"
          + "Name"        = "test1-devops10020220218"
          + "Project"     = "Kubeflow"
          + "Terraform"   = "true"
        }
    }

  # module.network.module.vpc.aws_route.private_nat_gateway[0] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block     = "0.0.0.0/0"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.network.module.vpc.aws_route.public_internet_gateway[0] will be created
  + resource "aws_route" "public_internet_gateway" {
      + destination_cidr_block     = "0.0.0.0/0"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.network.module.vpc.aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Environment" = "test1"
          + "Name"        = "test1-devops10020220218"
          + "Project"     = "Kubeflow"
          + "Terraform"   = "true"
        }
      + vpc_id           = (known after apply)
    }

  # module.network.module.vpc.aws_route_table.public[0] will be created
  + resource "aws_route_table" "public" {
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Environment" = "test1"
          + "Name"        = "test1-devops10020220218"
          + "Project"     = "Kubeflow"
          + "Terraform"   = "true"
        }
      + vpc_id           = (known after apply)
    }

  # module.network.module.vpc.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network.module.vpc.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network.module.vpc.aws_route_table_association.private[2] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network.module.vpc.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network.module.vpc.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network.module.vpc.aws_route_table_association.public[2] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network.module.vpc.aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "eu-central-1a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.10.200.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Environment"                             = "test1"
          + "Name"                                    = "test1-devops10020220218-private"
          + "Project"                                 = "Kubeflow"
          + "Terraform"                               = "true"
          + "kubernetes.io/cluster/devops10020220218" = "shared"
        }
      + vpc_id                          = (known after apply)
    }

  # module.network.module.vpc.aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "eu-central-1b"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.10.201.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Environment"                             = "test1"
          + "Name"                                    = "test1-devops10020220218-private"
          + "Project"                                 = "Kubeflow"
          + "Terraform"                               = "true"
          + "kubernetes.io/cluster/devops10020220218" = "shared"
        }
      + vpc_id                          = (known after apply)
    }

  # module.network.module.vpc.aws_subnet.private[2] will be created
  + resource "aws_subnet" "private" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "eu-central-1c"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.10.202.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Environment"                             = "test1"
          + "Name"                                    = "test1-devops10020220218-private"
          + "Project"                                 = "Kubeflow"
          + "Terraform"                               = "true"
          + "kubernetes.io/cluster/devops10020220218" = "shared"
        }
      + vpc_id                          = (known after apply)
    }

  # module.network.module.vpc.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "eu-central-1a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.10.0.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Environment"                             = "test1"
          + "KubernetesCluster"                       = "devops10020220218"
          + "Name"                                    = "test1-devops10020220218-public"
          + "Project"                                 = "Kubeflow"
          + "Terraform"                               = "true"
          + "kubernetes.io/cluster/devops10020220218" = "shared"
          + "kubernetes.io/role/elb"                  = ""
        }
      + vpc_id                          = (known after apply)
    }

  # module.network.module.vpc.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "eu-central-1b"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.10.1.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Environment"                             = "test1"
          + "KubernetesCluster"                       = "devops10020220218"
          + "Name"                                    = "test1-devops10020220218-public"
          + "Project"                                 = "Kubeflow"
          + "Terraform"                               = "true"
          + "kubernetes.io/cluster/devops10020220218" = "shared"
          + "kubernetes.io/role/elb"                  = ""
        }
      + vpc_id                          = (known after apply)
    }

  # module.network.module.vpc.aws_subnet.public[2] will be created
  + resource "aws_subnet" "public" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "eu-central-1c"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.10.2.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Environment"                             = "test1"
          + "KubernetesCluster"                       = "devops10020220218"
          + "Name"                                    = "test1-devops10020220218-public"
          + "Project"                                 = "Kubeflow"
          + "Terraform"                               = "true"
          + "kubernetes.io/cluster/devops10020220218" = "shared"
          + "kubernetes.io/role/elb"                  = ""
        }
      + vpc_id                          = (known after apply)
    }

  # module.network.module.vpc.aws_vpc.this[0] will be created
  + resource "aws_vpc" "this" {
      + arn                              = (known after apply)
      + assign_generated_ipv6_cidr_block = false
      + cidr_block                       = "10.10.0.0/16"
      + default_network_acl_id           = (known after apply)
      + default_route_table_id           = (known after apply)
      + default_security_group_id        = (known after apply)
      + dhcp_options_id                  = (known after apply)
      + enable_classiclink               = (known after apply)
      + enable_classiclink_dns_support   = (known after apply)
      + enable_dns_hostnames             = true
      + enable_dns_support               = true
      + id                               = (known after apply)
      + instance_tenancy                 = "default"
      + ipv6_association_id              = (known after apply)
      + ipv6_cidr_block                  = (known after apply)
      + main_route_table_id              = (known after apply)
      + owner_id                         = (known after apply)
      + tags                             = {
          + "Environment" = "test1"
          + "Name"        = "test1-devops10020220218"
          + "Project"     = "Kubeflow"
          + "Terraform"   = "true"
        }
    }

Plan: 113 to add, 0 to change, 0 to destroy.

Warning: Deprecated Resource

The null_data_source was historically used to construct intermediate values to
re-use elsewhere in configuration, the same can now be achieved using locals


------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

```

</details>

*Pusher: @devops100net, Action: `pull_request`*